Repository: ngm01/cli
Catalog: src/dotnet/commands/dotnet-install/dotnet-install-tool/xlf/LocalizableStrings.*.xlf
Languages: cs

# SourceOptionDescription
source: Specifies a NuGet package source to use during installation.
cs: Určuje zdroj balíčku NuGet, který se použije při instalaci.

# InstallationSucceeded
source: The installation succeeded. If there are no further instructions, you can type the following command in shell directly to invoke: {0}
cs: Instalace byla úspěšná. Pokud nejsou další pokyny, můžete přímo do jádra napsat následující příkaz k vyvolání: {0}

# FailedToAddPackage
source: Failed to add package. WorkingDirectory: {0} Arguments: {1} Output: {2}{3}
cs: Nepovedlo se přidat balíček. WorkingDirectory: {0} Argumenty: {1} Výstup: {2}{3}

# PackageIdArgumentDescription
source: NuGet Package Id of the tool to install.
cs: ID balíčku NuGet nástroje, který se má nainstalovat

# CommandDescription
source: Installs a tool for use on the command line.
cs: Nainstaluje nástroj, který se bude používat na příkazovém řádku.

# ConfigFileOptionDescription
source: The NuGet configuration file to use.
cs: Konfigurační soubor NuGet, který se použije.

# FrameworkOptionDescription
source: The target framework to install the tool for.
cs: Cílová architektura, pro kterou se má nástroj nainstalovat

# VersionOptionDescription
source: Version of the tool package in NuGet.
cs: Verze balíčku nástroje v NuGetu

# SpecifyExactlyOnePackageId
source: Please specify one tool Package Id to install.
cs: Zadejte prosím jedno ID balíčku nástroje, který se má nainstalovat.

# GlobalOptionDescription
source: Install user wide.
cs: Instalovat pro všechny uživatele

# InstallFullCommandNameLocalized
source: .NET Install Command
cs: Příkaz Instalovat rozhraní .NET

# InstallToolCommandOnlySupportGlobal
source: The --global switch (-g) is currently required because only user wide tools are supported.
cs: Přepínač --global (-g) se aktuálně vyžaduje, protože se podporují jenom nástroje pro všechny uživatele.
